Rahix/avr-device/vendor/attiny84a.atdf
        <register caption="MCU Control Register" name="MCUCR" offset="0x55" size="1">
          <bitfield caption="Pull-up Disable" mask="0x40" name="PUD"/>
          <bitfield caption="Sleep Enable" mask="0x20" name="SE"/>
          <bitfield caption="Sleep Mode Select Bits" mask="0x18" name="SM" values="CPU_SLEEP_MODE"/>
        </register>
        <register caption="MCU Status Register" name="MCUSR" offset="0x54" size="1">
          <bitfield caption="Watchdog Reset Flag" mask="0x08" name="WDRF"/>
          <bitfield caption="Brown-out Reset Flag" mask="0x04" name="BORF"/>
          <bitfield caption="External Reset Flag" mask="0x02" name="EXTRF"/>
          <bitfield caption="Power-on reset flag" mask="0x01" name="PORF"/>
        </register>
        <register caption="General Purpose I/O Register 2" name="GPIOR2" offset="0x35" size="1" mask="0xFF"/>
        <register caption="General Purpose I/O Register 1" name="GPIOR1" offset="0x34" size="1" mask="0xFF"/>
        <register caption="General Purpose I/O Register 0" name="GPIOR0" offset="0x33" size="1" mask="0xFF"/>
      </register-group>
      <value-group name="CPU_CLK_PRESCALE_4_BITS_SMALL">
        <value caption="1" name="1" value="0x00"/>
        <value caption="2" name="2" value="0x01"/>
        <value caption="4" name="4" value="0x02"/>
        <value caption="8" name="8" value="0x03"/>
        <value caption="16" name="16" value="0x04"/>
        <value caption="32" name="32" value="0x05"/>
        <value caption="64" name="64" value="0x06"/>
        <value caption="128" name="128" value="0x07"/>
        <value caption="256" name="256" value="0x08"/>
      </value-group>
      <value-group name="CPU_SLEEP_MODE">
        <value caption="Idle" name="IDLE" value="0x00"/>
        <value caption="ADC Noise Reduction (If Available)" name="ADC" value="0x01"/>
        <value caption="Power Down" name="PDOWN" value="0x02"/>
        <value caption="Standby" name="STDBY" value="0x03"/>
      </value-group>
      <value-group caption="Oscillator Calibration Values" name="OSCCAL_VALUE_ADDRESSES">
        <value value="0x00" caption="8.0 MHz" name="8_0_MHz"/>
      </value-group>
      
    </module>
  </modules>
    <pinouts>
    <pinout name="SOIC_14">
      <pin pad="VCC" position="1"/>
      <pin pad="PB0" position="2"/>
      <pin pad="PB1" position="3"/>
      <pin pad="PB3" position="4"/>
      <pin pad="PB2" position="5"/>
      <pin pad="PA7" position="6"/>
      <pin pad="PA6" position="7"/>
      <pin pad="PA5" position="8"/>
      <pin pad="PA4" position="9"/>
      <pin pad="PA3" position="10"/>
      <pin pad="PA2" position="11"/>
      <pin pad="PA1" position="12"/>
      <pin pad="PA0" position="13"/>
      <pin pad="GND" position="14"/>
    </pinout>
    <pinout name="QFN_20">
      <pin pad="PA4" position="1"/>
      <pin pad="PA3" position="2"/>
      <pin pad="PA2" position="3"/>
      <pin pad="PA1" position="4"/>
      <pin pad="PA0" position="5"/>
      <pin pad="GND" position="8"/>
      <pin pad="VCC" position="9"/>
      <pin pad="PB0" position="11"/>
      <pin pad="PB1" position="12"/>
      <pin pad="PB3" position="13"/>
      <pin pad="PB2" position="14"/>
      <pin pad="PA7" position="15"/>
      <pin pad="PA6" position="16"/>
      <pin pad="PA5" position="20"/>
    </pinout>
    <pinout name="BGA_16">
      <pin pad="PA5" position="A2"/>
      <pin pad="PA6" position="A3"/>
      <pin pad="PB2" position="A4"/>
      <pin pad="PA4" position="B1"/>
      <pin pad="PA7" position="B2"/>
      <pin pad="PB1" position="B3"/>
      <pin pad="PB3" position="B4"/>
      <pin pad="PA3" position="C1"/>
      <pin pad="PA2" position="C2"/>
      <pin pad="PA1" position="C3"/>
      <pin pad="PB0" position="C4"/>
      <pin pad="PA0" position="D1"/>
      <pin pad="GND" position="D2"/>
      <pin pad="GND" position="D3"/>
      <pin pad="VCC" position="D4"/>
    </pinout>
  </pinouts>
</avr-tools-device-file>
